Revit 2026 API

# IndependentTagRemoveReferences Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveReferences(
	IList<Reference> referencesToRemove
)
```
```vb
Public Sub RemoveReferences (
	referencesToRemove As IList(Of Reference)
)
```
```cpp
public:
void RemoveReferences(
	IList<Reference^>^ referencesToRemove
)
```
```fsharp
member RemoveReferences :
        referencesToRemove : IList<Reference> -> unit
```

#### Parameters

referencesToRemove IListReference

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace